{"Arcs-Beginner-Strategy":{"title":"Arcs Beginner Strategy","links":[],"tags":[],"content":"Winning initiative\n\nDeclaring first gives most points, but also tips hand\nHolding initiative later is preferable\nGet something well in hand before declaring if possible\n\nPiggybacking\n\nBuild a balance infrastructure while forgoing ambitions temporarily\nSecure strong court cards\n\nHand management\n\nEvery card has a use\nConstruction, Mobilization, Administration, Aggression worst to best\n"},"Boardgame-Storage-Product":{"title":"Boardgame Storage Product","links":["tags/fleeting"],"tags":["fleeting"],"content":"fleeting\nSteps\n\nDetermine basic unit of space\\\n\nSleeved cards width x width x length compartment\n\n\nDetermine how many basic units a storage bin should be\nDesign components to hold Wingspan\n\nPlayground\n\nMagnets on top and bottom to snap in?\n\n"},"Building-a-Pi-Zero-powered-media-player":{"title":"Building a Pi Zero powered media player","links":[],"tags":[],"content":"Parts\nPi Zero\n\nRadxa Pi 0\nRadxa Pi Zero 3W\nOrange Pi Zero\n\nCooling\n\nRadxa heat spreader\n\nScreen\n\nWaveshare 3.5 (for Pi Zero 2 w)\nWaveshare 4” e-ink\nWaveshare 4.3” e-ink UART\n"},"Detaching-todos-from-PKM":{"title":"Detaching todos from PKM","links":["tags/inbox","tags/fleeting","Personal-Knowledge-Management","Taking-notes-at-work-vs-taking-notes-at-home","How-do-I-minimize-the-mental-friction-of-taking-notes"],"tags":["inbox","fleeting"],"content":"inboxfleeting\nThe “todo” notes app and the PKM notes app are better served by different flows. Trying to integrate the day to day “todo” type of notes with your PKM makes both worse.\nAssociated topics\n\n\nPersonal Knowledge Management\nTaking notes at work vs taking notes at home\n\nQuestions\n\n\nHow do I minimize the mental friction of taking notes?\n"},"Digital-Minimalism":{"title":"Digital Minimalism","links":["The-Smartwatch-is-Not-What-You-Think","The-perfect-no-smartphone-load-out","Minimizing-distraction-while-at-the-computer","Hacking-my-brain-with-my-EDC"],"tags":[],"content":"Why digital minimalism?\nI think this topic comes about for people in many different ways. For me it was a realization I had when I was watching my one year old son play but constantly felt the urge to pull out my phone and scroll through digital sugar.\nThe hooks of the internet and constant notification spam are particularly dangerous for those of us with some type of attention disorder. There are the simple distractions like notifications of course, but even more potent are the algorithmic feeds and how they prey on the hyper-fixation common to the affected peoples. These algorithmic feeds calculate what topics the user is likely to engage with and moves them from one to the other over time in a way that allows for total consumption.\nMy goals with digital minimalism\n\nFree myself from as many algorithmic feeds as possible\nReplace these feeds with intentional media consumption\nMinimize the effects of digital minimalism on my social life as much as possible\n\nTopics\n\nThe Smartwatch is Not What You Think\nThe perfect no-smartphone load-out\nMinimizing distraction while at the computer\nHacking my brain with my EDC\n"},"Getting-Bus-Times-on-my-Smartwatch-if-IFTTT-and-n8n":{"title":"Getting Bus Times on my Smartwatch if IFTTT and n8n","links":["The-Smartwatch-is-Not-What-You-Think","Digital-Minimalism","Homelab"],"tags":[],"content":"Why?\nIf you’ve looked at The Smartwatch is Not What You Think or Digital Minimalism you know that I’m constantly looking for ways to reduce my dependence on my smartphone. One small reason I still pull it out of my locked server rack is to look at bus times on the OneBusAway app. Inevitably this interaction can lead to more undesirable interactions and so I’m looking to eliminate it. Unfortunately, there is no OneBusAway app for WearOS but I’m sure I can solve this problem with a little code and my Homelab.\nArchitecture\n\nI run a service called n8n on my Homelab which allows a user to easily build automations with a flowchart-like UI. n8n does not have any WearOS integration but IFTTT (which is a similar service found at IFTTT.com) does. IFTTT allows me to have a button which when pressed calls a webhook to activate the n8n flow.\nOnce n8n is invoked it sends a get call to the OneBusAway API in order to get the arrivals at my designated stop and uses a service called Pushover to send a notification to my phone which is forwarded to my smartwatch.\nIFTTT setup\n\nThe IFTTT set up is very simple, a button press and a webhook. The webhook request will go to the n8n URL (shown in the flow) and the generated the credentials needed are injected into the headers.\nn8n setup\n\nThe webhook step will allow you to configure the credentials. Everything else is very straight forward with the exception of the parse response javascript.\nParse response code\nconst arrivals = $input.all()[0].json.data.entry.arrivalsAndDepartures;\nconst minutes = arrivals\n  .filter(({ predicted, routeShortName }) =&gt; predicted &amp;&amp; routeShortName === &#039;40&#039;)\n  .map(({ predictedDepartureTime }) =&gt; {\n    const now = new Date().getTime();\n    const diff = predictedDepartureTime - now;\n    return Math.floor(diff / 60000);\n  }\n);\n \nreturn { minutes };\nThis code extracts the arrival times, filters them by route number, and returns their arrival times in minutes from now rounded down.\nResults\nInclude screenshot of watchface"},"Home":{"title":"Home","links":["Learning-in-Public","Digital-Minimalism","Moving-through-the-world-with-no-smartphone","The-perfect-no-smartphone-load-out","Building-a-Pi-Zero-powered-media-player","Getting-Bus-Times-on-my-Smartwatch-if-IFTTT-and-n8n","The-Smartwatch-is-Not-What-You-Think","Self-Hosting","Homelab","Youtube-without-Youtube","Planning-a-Homelab-Domain-Change","Home-Networking","Personal-Knowledge-Management","Taking-notes-at-work-vs-taking-notes-at-home","The-vision-for-this-digital-garden","Procyon/Procyon","Procyon/Procyon-World-Primer","Procyon/Procyon-Faction-Primer","Procyon/The-Way"],"tags":[],"content":"This is an exercise in Learning in Public. My notes here have not been vetted, edited, or fully thought out.\nWhere to start\nBelow are some categories that have consumed my brain at some point:\n\nDigital Minimalism\n\nMoving through the world with no smartphone\nThe perfect no-smartphone load-out\nBuilding a Pi Zero powered media player\nGetting Bus Times on my Smartwatch if IFTTT and n8n\nThe Smartwatch is Not What You Think\n\n\nSelf-Hosting\n\nHomelab\nYoutube without Youtube\nPlanning a Homelab Domain Change\n\n\nHome Networking\nPersonal Knowledge Management\n\nTaking notes at work vs taking notes at home\nThe vision for this digital garden\n\n\n\nTTRPGs\nProcyon (Scum &amp; Villainy)\n\nProcyon World Primer\nProcyon Faction Primer\nThe Way\n\nOutstanding tasks for this garden\n\n Integrate readwise\n Transfer some notes from old vault\n"},"Neovim":{"title":"Neovim","links":["tags/now","tags/nvim"],"tags":["now","nvim"],"content":"nownvim\nNeoVim is a text editor which runs entirely within the terminal. It is a fork of Vim which itself is descended from VI. As a terminal based editor it is built to be used entirely with the keyboard which allows for extremely efficient coding once it’s mastered.\nThe primary difference between Neovim and Vim seems to boil down to api organization and Lua support which has allowed the plugin ecosystem for Neovim to thrive.\nInstallation\n\nMake sure Homebrew is installed\nChoose a modern terminal emulator like wezTerm or Kittyto install. At least wezTerm can be installed with: brew install wezTerm\nbrew install neovim\n\nConfiguration\nI found the thought of installing and configuring 20 plugins extremely intimidating and so chose to use a starter config called NVChad which includes essential plugin and basic configuration. Check the NVChad website for up to date steps but at the time of writing it was as simple cloning the config into your ~/.config/nvim folder.\ngit clone github.com/NvChad/starter ~/.config/nvim &amp;&amp; nvim\n\nIf you think you&#039;ll do any custom configuration (you will), you may want to fork the NVChad starter config and use your fork. That way you&#039;ll be able to pull any changes you make easily to any system you&#039;re using.\n \nAdd lazy-lock.json to a .gitignore\nSetting up code servers with LSP\nIf you’re going to use Neovim to code you’ll likely want to set up LSP (Language Server Protocol) servers and auto completions for your language of choice. NVChad already includes nvim-lspconfig, nvim-cmp, and all of the other intermediary packages required for completions to work. Simply check out this documentation and follow the instructions for what you need. When you restart Neovim everything should be installed and functional.\nSetting up prettier\nTK, using github.com/MunifTanjim/prettier.nvim\nUsing Neovim\nWhat are modes?\nVi, Vim, or Neovim all require the user to swap between different modes to interact with the document in different ways. To someone used to normal code or document editors this will feel extremely unintuitive as you cannot simply move the cursor somewhere and start typing. In Neovim you start in “normal” mode where you are allowed to move the cursor but not type. In order to type you need to enter “insert” mode which by default is done with the “i” button.\nThroughout the rest of this note I will be writing hot keys as they are written in Neovim config files. Control(^) is C, Alt(⌥) or option is A, and Shift(⇧) is S. A combined keypress like Control + v would be written as \\&lt;C-v\\&gt;\nCommon modes\n\nNormal (esc when in other modes) - Used for basic navigation and entering other modes\nInsert (i, I, o , a, A) - Used for typing\nVisual (v, V, &lt;C-v&gt;) - Used for highlighting blocks\nCommand (:) - Used for running commands\nThe keys shown above are almost certainly not exhaustive and I’ll update them as I learn more.\n\nNon obvious controls\nTerminal modes\nWhen focused in the terminal you can enter “nterminal” or normal terminal mode with &lt;C-x&gt; which allows\nMy customizations"},"Planning-a-Homelab-Domain-Change":{"title":"Planning a Homelab Domain Change","links":[],"tags":[],"content":"Description\nI’m not a fan of the domain I use for most of my services, so I bought a new one at www.filco.dev. I started the process of transferring my services to the new domain and realized that it was going to require some planning.\nAreas of concern\nAuthelia configuration\nAuthelia can only handle one domain at a time, so I’ll need to transfer everything over. This includes items like my TOTP configuration, and I’m unsure how that will work.\nReverse proxy\nI’ll need to swap over a ton of domains and create new certificates and I don’t think I can do it piecemeal as my authentication can only handle a single domain.\nConfiguration of My Applications\nMany applications require configuration either pointing to other services or need their full FQDN set to operate properly. I’ll need to identify all of these cases and add them to my step list.\nIn addition, I have been looking to transition all of my docker containers to custom docker network(s), and taking the entire home lab down for a while presents a good opportunity to finally tackle that move. Unlike other things on this list, this can be done piecemeal as long as I keep the port forwarding in place.\nSteps\n\n Acquire new domain\n Set up DDNS for new domain\n Swap over 2FA configuration\n Change configuration options for applications\n\n Placeholder for service configurations\n\n\n Change reverse proxy configuration and request new certificates\n"},"Procyon/Actions-Primer":{"title":"Actions Primer","links":[],"tags":[],"content":"Action Descriptions\nAttune\nAttune to the Way, channeling supernatural forces, interacting with strange artifacts, or sensing hidden entities. Use this action when dealing with mystic phenomena or trying to navigate using the Way.\nCommand\nCommand is used to compel obedience, intimidate, or lead others by force of will. It can also be used to coordinate or order around a group, such as a squad of hired muscle or crew members.\nConsort\nConsort is used to socialize with allies, establish connections, gain information through personal networks, and make deals. This action is about leveraging relationships.\nDoctor\nDoctor is used for medical aid, surgery, chemical concoctions, and understanding biological systems. Whether healing a crewmate, crafting a poison, or researching a pathogen, this is your action.\nHack\nHack involves breaking into computer systems, manipulating digital networks, and using technology against others. It’s about dealing with electronic systems, from unlocking doors to sabotaging enemy ships.\nHelm\nHelm is used to pilot vehicles or ships, guiding them through dangerous situations or performing complex maneuvers. Whether you’re flying a spaceship or operating a hover vehicle, this is your action.\nRig\nRig is used to build, repair, or modify machines, devices, or equipment. It’s for all things mechanical or technical, from weapon maintenance to explosives setup.\nScramble\nScramble is used for fast movement, athletic actions, and climbing or jumping to avoid danger or pursue a target. It helps with high-energy activities like parkour or fleeing through crowds.\nScrap\nScrap is the action used for hand-to-hand combat, brawling, and close-quarter fighting. Whether it’s punches, kicks, or using melee weapons, this is how you handle physical conflict up close.\nSkulk\nSkulk is used to move silently, pickpocket, sneak into buildings, or avoid detection. It’s the action for stealthy operations and trickery when subtlety is key.\nStudy\nStudy is for careful observation, research, and detailed examination. It’s useful for analyzing clues, reading books or databases, or deducing hidden truths.\nSway\nSway is the action for persuasion, deception, bluffing, and manipulation. Whether through charm, lies, or rhetoric, you use this action to get others to do what you want."},"Procyon/Attune-Examples":{"title":"Attune Examples","links":[],"tags":[],"content":"\nSha-sihara the Speaker (who trains with her ship’s Mystic) has\nbeen waiting in the Governor’s mansion when she notices a\nserving-drone carrying refreshments. She attunes to it, stops\nit, and turns up the charm in response to its upset whistles and\nchirps, asking it to take her through the drone entrance to meet\nthe Governor.\nRogan’s crew has smuggled a Guild scientist to some Suneaters\non Indri. They’re about to cash in when the Urbot by the Suneaters\ntwitches, grabs a gun, and opens fire. “Not so fast!” says Rogan’s\nplayer. “I can sense killing intent by attuning to the Way. Flash\nback to a few seconds earlier where I frown, look around, and yell\n‘Look out!’ before the robot fires.” “Cool, sounds like a 0 stress\nflashback since you folks are a bit nervous about this handoff in\nthe first place. It’s a risky roll, where the risk is you paint yourself\nas the first target for that killer Urbot when you yell.”\nNegotiating with an Ashen Knives Pasha, Sha-sihara realizes\nshe spoke words she didn’t intend to. She disguises her surprise\nby sipping on some Shimayan sun wine, and attunes to the Way,\nlooking for the danger. She sees Way-warping around the Pasha’s\nring—he has an artifact that forces both parties to say nothing\nbut the truth. She studies it, gathering info, and realizes that it\ndoesn’t prevent omission or false implication. The negotiations\njust got interesting. She sets her glass down and continues the\nnegotiations.\nThe crew of the Starbreaker is on the fifth moon of Nightfall,\nfollowing a map to an Ur artifact that might sell well on the black\nmarket. A giant pair of doors blocks the way, with no obvious\nopening mechanism. U’tu, their Mystic, attunes to the Way,\nbecoming one with the doors. He safely activates the Precursor\nmechanism in the doors and opens them for his crew.\nSha-sihara is stealthily leading her crew onto the Governor’s\ngrounds for a job, but the Governor’s prized Kyraxxian razor\nhounds are roaming the gardens! She steps forward, attuning\nto them and smiles, putting her command to good use. Because\nthey’re well-trained, and naturally predatory, she uses the attune\nroll effectively as a setup action and commands at a much better\nposition now that they can understand her.\n"},"Procyon/Backgrounds":{"title":"Backgrounds","links":[],"tags":[],"content":"Academic\nYou were a professor, student, researcher, or had some other knowledge-driven vocation. Your experience is in scholarly pursuits, and you may have spent time in universities or research institutions.\nLabor\nYou come from a background of physical work. You might have been a factory worker, driver, dockhand, miner, or another type of tradesperson. The majority of the Hegemony population shares this background.\nCult\nYou were part of a Cult, whether officially sanctioned or underground. Your role could have been that of a holy warrior, priest, or devout religious adherent. This background emphasizes a connection to a spiritual or mystical group.\nGuilder\nYou were involved in the machinations of a Guild, perhaps as a ship designer, financial analyst, or logistics officer. Guilders are embedded in the corporate and economic systems of the Hegemony.\nMilitary\nYou served in the military as a Hegemonic soldier, mercenary, intelligence operative, strategist, or training instructor. This background gives you combat and tactical experience.\nNoble\nYou come from a life of luxury, perhaps as a dilettante or someone engaged in the complex politics of the Noble Houses. Your background suggests a life of privilege, though it might also come with responsibilities or entanglements in House politics.\nSyndicate\nYou were part of an organized criminal group, ranging from a lowly lookout to a former crime lord. This background places you within the shadowy world of syndicates and criminal enterprises."},"Procyon/Behind-the-Screen/Session-0-Prep--and--Notes":{"title":"Session 0 Prep & Notes","links":["Procyon/Player-Characters/Lando-Impera","Procyon/Yattu,-a-Gang-Boss","Choss,-a-Professional-Racer","Procyon/Player-Characters/Ignor-Indigo","Slice,-a-Junkyard-Owner","Kenn-Indigo,-a-Family-Member","Procyon/Player-Characters/7-D","Yaru-(Makers-Guild)","Procyon/Yazu,-a-Crooked-Cop","Chon-zek,-a-Bounty-Hunter","Ishi,-a-weapons-dealer","Wreckers","51st-Legion"],"tags":[],"content":"Prep\nLog\nCharacter Creation\nChris character creation\n\nName: Lando Impera\nAlias: Intake\nLook: Bomber jacket, flight suits, very pilot\nHeritage: Imperial\n\n2nd son of a noble family\nWas an officer in the military\nConsort\n\n\nBackground: Military\n\nStarted working with the Wreckers while still in the military\nSent out as undercover but is now just a criminal\nHack\n\n\nOther actions: Scrap + Command\nFriend: Yattu, a Gang Boss\n\nGot to know him while working with the wreckers\n\n\nRival:  Choss, a Professional Racer\n\nGrew up together, Choss races in the F1 equivalent, Lando thinks he’s cheating\n\n\nVice: Gambling\n\nGambles on the F1 equivalent\n\n\n\nTom\n\nName: Ignor Indigo\nAlias: Iron\nLook: Super skinny, diminutive, with huge hands. Wears spectacles and jorts.\nHeritage: Wanderer\n\nAlways had an interest in tinkering so he became a mechanic\nScramble\n\n\nBackground: Noble\n\n1st son of a noble family who was disinherited so 2nd son could inherit\nStudy\n\n\nHelm Hack\nFriend: Slice, a Junkyard Owner\n\nTook him in after family disinherited, father he never had\n\n\nRival: Kenn Indigo, a Family Member\n\nYounger brother he stole a ship from\n\n\nVice: Nice ass tools (luxury)\n\nPaul\n\nName: 7-D\nAlias: Dread\nLook: Wears a hat to cover his brand, and a duster\nHeritage: Manufactured\n\nYaru (Makers Guild) escaped clone, was “overcooked”\nDoctor - Healed other clones\n\n\nBackground: Cult\n\nLived as a normal clone for a while, then escaped violently\nAttune\n\n\n2 in scramble\nFriend: Yazu, a Crooked Cop\n\nIn his escape, Yazu could have stopped him but didn’t\n\n\nRival: Chon-zek, a Bounty Hunter\n\nIs hunting him for the Yaru\n\n\nVice: Stupor\n\nAlcoholic bender\n\n\n\nCrew Creation\n\nShip: Cerberus\nReputation: Brutal\nSpecial ability: Licensed\n\n2 heat on any legit bounty job\nCan have particle weapons\nCan you heavy weapons\n\n\nClose contact:\n\nIshi, a weapons dealer\n\nFriendly with Wreckers\nUnfriendly with 51st Legion\n\n\n\n\n\nStory begins!\n\nIn a janky motel named “Paradise” on the 2nd story about to kick in Cho’s door when they hear a hover bike rev up in the alley\nHeavy plasma fire rips through the hallway snaking toward them\n7-D runs down the hall to kick in the next door\n\nSucceeds but hurts his leg by kicking through the door\n\n\nIgnor provides cover fire as a distraction\nLando heads through the door that 7-D kicked open, takes aim, and blasts the hoverbike. The hover bikes goes out of control and Cho needs to bail failing one story and beginning to limp down the alley\n7-D tries to ride the fire escape down to the alley but it catches and he falls and knocks the wind out of himself\nLando runs after Cho down the alley and gets on his hoverbike he parked in a flashback\nLando pilots his hoverbike toward Cho, striking and pinning him to a pole and knocking out Cho’s unknown tiny companion riding on his back.\n\nAble to narrowly avoid getting shot by swerving aggressively\n\n\n"},"Procyon/Behind-the-Screen/Session-1-Prep--and--Notes":{"title":"Session 1 Prep & Notes","links":["Yaru-(Makers-Guild)","Procyon/Yattu,-a-Gang-Boss","The-Enclave","Procyon/Yazu,-a-Crooked-Cop"],"tags":[],"content":"Last session recap\nThe neon lights of Warren’s industrial sector flicker over the rundown façade of the motel—“Paradise.” On the second floor, you’re crouched in the dimly lit hallway, tense and ready to kick in Cho’s door. The air is thick with the quiet hum of the city until it’s suddenly shattered by the roar of a hoverbike revving to life in the alley below.\nBefore anyone can react, plasma fire rips through the hallway, burning across the walls in searing arcs. It’s moving toward you, fast, cutting through drywall and filling the space with the sharp scent of scorched metal.\nWithout missing a beat, 7-D charges forward, kicking open the next door. The door caves under the force, but the impact isn’t kind to him. He grits his teeth as pain shoots up his leg—he’s hurt, but it’s open.\nIgnor ducks into cover, raising his blaster to lay down some suppressing fire. His shots flare in the smoke-filled corridor, creating just enough of a distraction to give the others a chance.\nLando doesn’t waste a second. He slips through the open door, spotting Cho’s hoverbike revving in the alley below. Lining up his blaster, he takes the shot. The plasma bolt hits true, and the bike careens out of control. Cho leaps off, hitting the ground hard, tumbling to the alley floor. He staggers to his feet, limping now, clearly hurt.\n7-D limps to the fire escape, determined to keep up. He grabs the rusted rails and swings down, but the escape gives way under his weight. He crashes to the ground, the wind knocked out of him, gasping for breath as the chase continues without him.\nLando quickly drops down next to the writhing 7-D without sparing him a glance, and takes off down the alley. In a quick flashback, he remembers where he parked his hoverbike—just around the corner. He jumps on, and the engines roar to life as he barrels down the alley after Cho. The bike weaves effortlessly between dumpsters and debris, and with a sharp swerve, Lando slams into Cho, pinning him against a metal pole. The impact is hard, and something else falls from Cho’s back—a tiny companion, knocked out cold.\nQuestions\n\nWho was the small figure?\n\nThe small figure is a natural children of clones like 7-D who are living in a hidden enclave.\nShe was kidnapped by the Yaru for study\n\n\n\nPlayground\nThe Ashen Knives were hired by the Yaru (Makers Guild) to kidnap Ara’ini, a natural children of escaped Yaru clones. The Yaru want to study her as she is the only known offspring of these clones.\nCho decided against delivering her to the knives, he didn’t know it was a child when he was given the job.\nLog\n\nThey speak to Cho and the girl\nCho gives the story of how he was hired and couldn’t do it\nThey manage to speak to the girl and she thinks 7-D is her dad briefly, says her dad’s name are Orrin and Thane\nThey debate killing Cho and go back to talk to him\nHe said the ships name was called the Abra\nThe girl was stolen twice\nLando tries to intimidate and succeeds but scares the shit out of Ara’ini\nLando really pushing to not keep Ara’ini\nChoss races in the DSL, Double Sonic Racing League\n\nDowntime\n\nLando trained and indulged\n\nTalked to Yattu, a Gang Boss about The Enclave and watched Choss win another race\n\n\n7-D over-indulge and recovered\n\nTalked to Yazu, a Crooked Cop\n\nYazu mentioned that he hadn’t heard of the Enclave but had heard rumors of other clone-slaves who had escaped before. They just disappeared.\n\n\n\n\nThey watch Big Shot and hear about 3 jobs\n\n\n"},"Procyon/Character-Creation":{"title":"Character Creation","links":["Procyon/Heritages","Procyon/Backgrounds","Procyon/Actions-Primer"],"tags":[],"content":"1. Choose a Playbook\nYour playbook contains all the specific rules needed to play a certain character type in Scum and Villainy. There are seven basic playbooks:\nMuscle\nMuscles are good at winning fights.\nPlay a Muscle if you want to be unstoppable in combat.\nPilot\nPilots are the best behind the wheel and well-traveled.\nPlay a Pilot if you want to be a daredevil at the controls and widely traveled.\nSpeaker\nSpeakers use their connections and smooth talk to manipulate others.\nPlay a Speaker if you want to be the respectable one and use connections to get your way.\nStitch\nStitches are medics and deal with science, patching people up, and keeping the crew going.\nPlay a Stitch to deal with science, patch people up, and be the crew’s moral compass.\nMechanic\nMechanics are technological experts who keep things running and create new devices.\nPlay a Mechanic if you want to make new devices, keep your ship in good shape, or hack systems.\nMystic\nMystics are good at dealing with the Way and all its mysteries.\nPlay a Mystic if you want to use artifacts and weird powers.\nScoundrel\nScoundrels are risk-takers and troublemakers.\nPlay a Scoundrel if you want to press your luck and find your way out of trouble.\n2. Choose a Starting Ability\nEach playbook begins with a unique starting ability marked on your sheet. This helps define your role on the crew and how factions in the sector view you.\n3. Choose a Special Ability\nEach playbook has a list of special abilities. Choose one special ability for your character. If you can’t decide, the first ability on the list is a good starting choice.\nNote: Veteran advances allow you to take special abilities from other playbooks.\n4. Choose a Heritage\nReference: Heritages\nYour heritage reflects where and how your character was raised. Pick one and add a small description (e.g., Spacer: Ice miners from Holt).\n5. Choose a Background\nReference: Backgrounds\nYour background represents what your character did before joining the crew. Add a detail to personalize it (e.g., Cult: Church of Stellar Flame initiate).\n6. Assign Four Action Dots\nReference: Actions Primer\nEach playbook begins with some action dots. You can now assign 4 additional dots. Follow these guidelines:\n\nIncrease one action by 1 dot that reflects your character’s heritage.\nIncrease one action by 1 dot that reflects your character’s background.\nIncrease two more actions by 1 dot in any category.\nNote: No action may be rated higher than 2 during character creation.\n\n7. Choose a Close Friend and a Rival\nFrom the list of NPCs on your playbook, choose one who is a close friend (mark with an upward triangle) and one who is a rival or enemy (mark with a downward triangle).\n8. Choose a Vice\nPick a vice for your character that helps them relieve stress. Choose from the list and add specific details (e.g., Pleasure: Rare delicacies from distant planets). Vices include:\n\nFaith: Belonging to a religious group or belief system.\nGambling: Taking part in games of chance.\nLuxury: Indulgence in wealth or fine things.\nObligation: A devotion to a cause, family, or group.\nPleasure: Seeking gratification through sensual indulgence.\nStupor: Numbing the senses with substances.\nWeird: Exploring the mystical, often with the Way.\n\n9. Record Your Name, Alias, and Look\nChoose a name for your character and add an alias if they have one. Describe their look using the options provided or your own ideas.\n10. Review Your Details\nLook over the XP triggers for your playbook and the items available to your character. You’ll use these during play. Now, your character is ready to begin their journey!&gt;&gt;"},"Procyon/Crew-Creation":{"title":"Crew Creation","links":["Procyon/Crew-Gear","Procyon/Ship-Gear","Procyon/Ship-Modules"],"tags":[],"content":"1. Choose a Ship\nYour ship type determines the jobs you’ll focus on and comes with special abilities and upgrades that support your chosen style of action. Your ship also defines how you are seen by the factions of the sector, whether as smugglers, bounty hunters, or rebels. The three main ship types are:\n\nCerberus: Extraction specialists focusing on bounty hunting and retrieval.\nStardancer: Smugglers and blockade runners.\nFiredrake: Rebels and criminals fighting the Hegemony.\n\nOnce chosen, grab the appropriate ship sheet for that type and proceed with the following steps.\n2. Choose a Reputation\nWhat reputation has your crew already earned among the factions? This reputation will guide your gameplay and influence XP rewards. Select one from the list:\n\nAmbitious\nBrutal\nDaring\nHonorable\nProfessional\nSavvy\nStrange\nSubtle\n\nYou can also create your own. XP is earned when bolstering this reputation.\n3. Customize Your Ship\nEach ship comes with a set of starting systems (e.g., Hull, Engines, Weapons, Comms). You can upgrade two systems from the following categories:\n\nEngines\nHull\nComms\nWeapons\n\nAlternatively, you can improve crew quality instead of a system, which will cost your crew 2 CREd and require a favor from a faction. Depending on your choice, the GM will assign a faction that either helped you or was wronged during the process. You must decide how to respond:\n\nPay them off (1 CREd, no strings attached).\nOwe them one (Promise to return the favor, gaining +1 status).\nStiff them (Take -1 status).\n\n4. Choose a Special Ability\nEach ship has its own special abilities. Choose one for your crew. If unsure, the first ability on the list is a solid choice for beginners.\n5. Assign Upgrades\nYou may select two upgrades for your ship. Options can include:\n\nCrew Upgrade: Choose one (Insight, Resolve, Prowess, or Playbook) and when you train that specific XP during downtime mark 2 XP instead of 1.\nCrew Gear: Start with vehicles or other equipment.\nShip Gear: General upgrades to your ship\nShip Modules: Augment the ship physically with things like a Medical bay or a Cloaking device\n\nOnce selected, your GM will inform you of two factions impacted by these choices:\n\nOne faction helped, gaining +1 status with your crew.\nOne faction was harmed, causing -1 status (unless you resolve it).\n\n6. Choose a Favorite Contact\nEvery ship has a list of NPC contacts. Choose one who is particularly close to your crew. Your GM will then assign:\n\nOne faction that is friendly with this contact, granting +1 status.\nOne faction that is unfriendly, giving -1 status.\n\n7. Update Your Ship Info\nFinally, update your ship’s essential stats:\n\nGambits: These refresh at the start of every job. (Stardancer and Firedrake start with 2; Cerberus starts with 1).\nUpkeep: Add your crew quality to all system qualities, divide by 4, and round down. This is your ship’s upkeep cost (usually 2 at the start).\n"},"Procyon/Crew-Gear":{"title":"Crew Gear","links":[],"tags":[],"content":"Alien Pet\nA lovable rapscallion or loyal guardian. These critters are often more trouble than they’re worth. Where did you get it?\nLand Transport\nThis gear includes enough land transportation for the entire crew, typically motorized bikes, land-skimmers, boats, or very small cars. These vehicles may have tires or hover close to the ground.\nRecon Drone\nA small drone used for surveillance, mapping, and intelligence gathering both in space and atmosphere. The drone can be given simple instructions like “search the mine for heat signatures.” It uses your ship’s comms quality when contested.\nSurvival Gear\nEquipment for surviving on inhospitable, but not uninhabitable, planets. Includes camping gear, rebreathers, climbing equipment, scuba gear, and stillsuits.\nWorkshop\nA mobile workshop equipped with plasma cutters, a nano-assembler, stock of metal and electrical components, and a forge. This gear is useful for building, modifying, or disassembling complex machines, weapons, and tools. It provides +1 quality to crafting rolls."},"Procyon/Hegemonic-Cults":{"title":"Hegemonic Cults","links":["Precursor","Urbot","StarSmiths-Guild","Xenos","Church-of-Stellar-Flame","Vault-Keepers","Cult-of-the-Seekers","Procyon/The-Way","Procyon/Mystics"],"tags":[],"content":"The Hegemony takes the stance that Precursor artifacts and Ur sites are dangerous and should be left to those who will take the burden (and responsibility) from the weary shoulders of the average citizen. The two groups that do this most widely are the Guilds and the Cults.\nThe Guilds generally don’t deal in mysticism. Their control is related to specific artifacts and technologies derived from them. For example the Engineers control and reprogram Urbot AI cores, while the StarSmiths Guild forge jump drives and maintain the gates.\nThe Hegemonic Cults are approved religious and mystical structures, spread widely through the Hegemony. It’s trendy for Nobles to have a Confessor from one of the approved Cults, and representatives from several advise the Hegemon on spiritual matters. They regulate which mystics are allowed to exist. The Cults wield political power not unlike the Guilds and Nobles, and similarly squabble amongst each other. Ultimately, their power is derived from the Hegemon, who decides which Cults are approved—an authority often used for political gain. The Seekers only became a true Hegemonic Cult because one of their members is the mother of the current Hegemon.\nFarther from the Core, Cult power becomes less dominant. Xenos have mystics of their own. Certain Cults may have strongholds in some systems (with many faithful) but little presence in others.\nThe Church of Stellar Flame claims that all people have a holy Light inside them, darkened by exposure to Ur sites and artifacts. They accuse mystics of dimming this Light and have a branch of Inquisitors dedicated to rooting out sources of such corruption. They’re generally seen as zealots, and might have been removed as an official Cult long ago, except that the militant orders within the Church (with their powerful and complex battle armors) have been useful tools for past Hegemons.\nNear the Core, one might find the Vault Keepers, who hollow out planets to store artifacts deemed too powerful to be used.\nFarther out in the distant sector, one might come across the Mendicants, who once tended to the sick and wounded throughout the Hegemony, but were branded heretics by the Church of Stellar Flame and purged during the last Hegemon’s ascension. Or perhaps the Cult of the Seekers, who look to find new and unexplored places, open locked gates, and believe with incredible intensity that all places should be visited and explored, and to go to an unknown place is a sacred rite.\nRelated topics\n\nThe Way\nMystics\n"},"Procyon/Heritages":{"title":"Heritages","links":[],"tags":[],"content":"Imperial\nThose with Imperial heritage hail from Warren or the Core worlds. You were brought up educated in the ways of the Hegemony, whether through Guild vocational education, Cult teachings, or Noble family tutors.\nSpacer\nSpacers are families that live in space. Ice miners, station mechanics, and most merchants are born, grow old, and die on spaceships—and may view terrestrial ventures with suspicion.\nColonist\nColonists form the backbone of the Hegemony. These are the farmers, miners, and terraformers that live on the borders of planets, dealing with alien beasts and Precursor ruins more often than most.\nManufactured\nManufactured families are created by the Guilds. These could be Yaru clones who’ve escaped from a facility, or Urbots that have avoided routine memory wipes. They often must hide their origin and independence.\nWanderer\nWanderers come from nomadic families that roam the galaxy. They move from planet to planet as opportunities arise, following economic shifts or simply where the Way takes them."},"Procyon/How-to-Play-Arcs":{"title":"How to Play Arcs","links":[],"tags":[],"content":"Setup &amp; Components\n\nPlayerboard and same colored components\n\n15 ships\n\nAlso have 2 states, damaged when tipped over\n\n\n10 agents\n10 buildings\n\n5 cities\n5 starports\n2 sides, fresh + damaged\n\nStart with all fresh\n\n\n\n\nYour pieces are called Loyal pieces\nOpponents pieces are called rival pieces\n\n\nPut 0 marker on ambition declared\nPut ambition markers on blue side in hex spots highest to lowest\nChapter counter on 1\nMake supplies of resources\n\n5 copies of each\n\n\nMake supplies of battle dice\n\n6 of each\nRed = assault blue = skirmish orange = raid\n\n\nSet up action card deck\n\nEntire deck for 4 player\nIf fewer separate the 7s and 1s and return them to the box\n6 cards to each player\n\n\nrandomly choose 1 player to start\n\nIn a 2 player game the person who goes 2nd can mulligan the deal\n\n\nDiscards are always facedown in the discard pile\ncannot show other players your hand\nVox &amp; guild cards are shuffled together\n\nDeal out 4 face up (the court) (3 in 2 person game)\n\n\n1st game get rid of leader cards and lore cards\nDraw a set up card and set up pieces on the map\n\nCards\n\nNumber\nAmbition icon\nNumber of pips\nSuit\n\nMap\n\n6 clusters\n\n4 systems\n\n1 gate\n3 planets\n\n\n\n\nBlock out gates which are excluded\nBlock out planets which are excluded\nWhoever has initiative is player 1 numbers go clockwise\n3 fresh ships and fresh city in A system\n3 fresh ships and a starport in B system\n2 fresh ships in C system or systems\nCheck resource produced where your buildings were placed at add one of each to your player board\n\nA resource on the left\n\n\nIn 2 player game only\n\nCheck which resources are out of play and put them in the ambition slots which depict those resources and weapons going to warlord\n\n\n\nPlay\n\nPlayed in chapters\nUse cards in their hands in a tricktaking like game\n\nDeclare actions\nFight for initiative\n\n\nConstructing\nTaxing\nMoving and battling\nInfluencing the court\nAll points come from ambitions which players declare and then fight for\n\nEach chapter up to 3 ambitions can be declared\nResource based\n\nTycoons\nKeeper\nEmpath\n\n\nWarlord is duh\nTyrant is capturing agents\nLowest scoring ambition flips after each chapter\n\n\nPlay until end of 6th chapter or until someone has points to win\nPlay starts with initiative then clockwise\nChapter ends when people are out of cards\n\nPlayer with initiative\n\n\nLead phase\n\nInitiative plays 1 card face up in the lead spot\n\nHaving played a lead card you can declare the ambition on the card\n\nAn ambition can be declared multiple times\n7s can be used to declare any ambition\n1s cannot be used to declare an ambition\nIf you declare an ambition put the 0 ambition declared over the number\n\nPips are not effected\n\n\n\n\n\n\n\n\n\nPrelude phase\n\nCan use prelude effects on cards you have\nSpend resources to take prelude actions\n\n\n\nTake actions\n\n7 different actions in the game\nSuits give access to 2 or 3 of them\nTake 1 action for each pip on the card you played\n\n\n\n\n\nNext player\n\nPlay a card\n\nSurpass\n\nPlay a card matching suit of a higher number\nSurpassing only needs to be a higher number then the lead card not any following cards\n\n\nCopy\n\nAny card from hand and play it face down\n\n\nPivot\n\nAny card that does not match lead suit and play face up\n\n\nSeizing initiative\n\nYou can play a 2nd card from your hand and playing it face down in order to seize initiative\n\nThis card does nothing for actions later\n\n\nIn 4 player game you can surpass with the 7 to surpass\n\nLeading doesnt count\n\n\nTake the marker and lay it besides your board\n\nCannot be resiezed\n\n\n\n\n\n\nAfter playing card play your prelude phase\nTake actions\n\nSurpass\n\nTake one action matching suit for each pip\n\n\nCopy\n\nSingle action matching the lead card\n\n\nPivot\n\nSingle action on card you played\n\n\n\n\n\n\n\nEnd of round\n\nContinue until every player who had cards takes a turn\nIf no one seized then whatever player surpassed with the highest card gets initiative\nDiscard all played cards facedown\nStart next round!\n\n\n\nActions\n\n\nBuild\n\nOnly on construction cards\nConstruct a building\n\nStartport\nLeftmost city\nEmpty building slot on a planet system where you have 1 loyal piece\n\n\nBuild a ship\n\n1 ship in a system with a loyal starport\n1 ship per starport per turn\n\n\nIf you build something into a system which is controlled by a rival it enters play damaged\n\nBuilt into neutral places are fresh\n\n\n\n\n\nRepair\n\nOn administration and construction\nRepair 1 thing on the board from damaged to fresh\n\n\n\nTax\n\nOnly on administration\nTaxes a city\n\nOne of your cities\n\nOne resources matching that planet\n\n\nA rival city in a system you control\n\nOne resource matching that planet\nCapture one agent\n\nPut into captives box\n\n\n\n\n\n\nEach city can only be taxed once per turn\nAny resources you gain are placed into the slots at the top of player board\n\nOnly when you gain a resource can you re-arrange\nIf you gain above your capacity (resource slot blocked) you must discard down to cap\n\n\n\n\n\nInfluence\n\nOn mobilization and Admin\nTake agent from your supply and place on any card in the court\n\nNo limit to number or combo\n\n\n\n\n\nSecure\n\nOnly on aggression\nTake one court card where you have the most agents present on the card\nIf there’s a “When secured” effect do it now\nReplace the card in the court\n\n\n\nMove\n\nMobil and aggro\nStandard\n\nOne or more ships from a single system and move them to adjacent system\nDon’t need to move all ships\n\n\nCatapult\n\nOne or more ships from a system with a loyal starport\nMove them through any number of adjacent spaces until you want to stop OR you hit a gate system controlled by a rival\n\nCan drop off ships off at gate systems on the way but cannot pick up\n\n\nCan only go to a single planet system with a catapult\n\n\n\n\n\nBattle\n\nAggro\nChoose the system\n\nYour buildings don’t count as the attacker\n\n\nChoose 1 rival to battle\n\nAll of that rivals pieces (ships and buildings) are defending pieces\n\n\nSingle die roll by attacker\n\nMake a pool of dice 1 die per attacking ship, fresh or damaged\n\nFreely choose what type of dice to use\n\nRaid can only be used if defenders have a building in system\nOR no buildings on entire map\n\n\n\n\n\nDice types\n\nAssault\n\nHigh damage but with risk of damage\n\n\nSkirmish\n\nLow dam but no risk\n\n\nRaid\n\nHighest risk but allows stealing resources and cards from defenders\n\n\n\n\nRoll dice and resolve in this order\n\nFor each flame, one attacking ship suffers 1 damage\nIf any dice show a ring you need to take “intercept” damage\n\n1 damage for each of the defenders fresh ships\nOnly happens once even if you roll multiple\n\n\nDestroyed ships goes to the players trophy box\nEach star hits a ship or building (if no ships are left)\nEach star with triangle inside do 1 damage to building (even if ships are left)\nAdd up keys you roll and steal that many keys worth of resources or cards from the opponent\n\n\nIf you destroy a city\n\nProvoke outrage with the class of planet that the city was on\n\nDiscard all resources and guild cards of that type\nPermanently move agent onto the outrage slot for that resource\n\nLose access to agent and prelude action\n\n\nIf you have no agent you need a placeholder\nDoesn’t prevent you from getting that resource or guild type in the future\n\n\nRansack the court\n\nChoose any card that has defenders agents on it\n\nSecure the card\n\nRival agents on the card are taken as trophies, not captives\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrelude\n\nPrelude actions come from 2 main places\n\nGuild cards\n\nResolve the text on the card\n\n\nResources\n\nDiscard one resource and resolve the effect listed\nDoes not go back to the supply until the end of the prelude step\n\n\n\n\n\nEnd of chapter\n\nIf a non-init player has no cards just skip\nIf init-player has no cards, end round and move init to the left\nIf you have init you can voluntarily pass init to the left and end the round\n\nThis can end the chapter if all players with cards have passed init\n\n\n\nResolve each declared ambition\n\nIf tied all players get 2nd place point\nMust have a single point to qualify for any\nCards have icon that count for tycoon type ones\nKeeper goes to the most relics\nEmpath to the most psionic\nThere are bonuses underneath the last 2 cities which you get if you cleanly win an ambition\nIn a 2 person games the tokens set aside represent a neutral 3rd party\nIf it’s the end of the 5th chapter or someone has enough points the game ends\n\nIf 2 players are tied then the turn order by current initiative breaks tie\n\n\nIf Tyrant was resolved, all players return captives\nIf Warlord was resolved, all players return trophies\n\n\nReturn ambitions to top of the board and flip the lowest\nGather up action cards shuffle and redeal hands of six\n\nDefinitions\n\n\nControl\n\nA system is controlled by whichever player has the most fresh ships present\nTie goes to no-one\n\n\n\nAdjacent systems\n\nConnected by a single line\nAcross a gate arrow\n\n\n"},"Procyon/Mystics":{"title":"Mystics","links":["Procyon/The-Way","Procyon/Hegemonic-Cults"],"tags":[],"content":"“Mystic” is a catch-all for members of various groups that espouse particular philosophies about the Way. Many have sacred sites (often near Precursor ruins) and artifacts that members carry or inherit. There are hundreds of mystic groups and their requirements for membership are equally varied. Some only have a handful of adherents, whereas others are so powerful that members are only talked about in hushed tones. The farther from the Core you go, the more brazen they are about showcasing their garb and powers.\nMystics often wander, looking for sites and Ur artifacts for their group. Ones that settle or build shrines often trade wisdom, cleanse houses of Way creatures, and provide guidance to locals. Because of the prevalence of artifacts among Syndicates and the Nobility, those in power often hire a mystic to “handle” such issues their rivals might bring to bear. It’s not unusual for a Syndicate or faction leader to have a mystic at their beck and call.\nRelated topics\n\nThe Way\nHegemonic Cults\n"},"Procyon/Player-Characters/7-D":{"title":"7-D","links":["Procyon/Yazu,-a-Crooked-Cop","Chon-zek,-a-Bounty-Hunter"],"tags":[],"content":"Alias: Dread\nLook: Always wears a hat and a leather duster to cover the brand on his forehead\nHeritage: Manufactured\nBackground: Cult\nVice: Alcohol benders\nBackstory\n7-D was created by the Yaru, the notorious bioengineers of the Makers Guild, as part of their clone-slave workforce. Like all clones, he was designed for a short lifespan, meant to serve and deteriorate after a few years. But something went wrong—or right—during his creation. 7-D was “overcooked,” a term used by the Yaru for clones who resist the typical rapid aging and breakdown. Unlike his fellow clones, 7-D didn’t deteriorate. He watched as those around him, his friends and fellow workers, succumbed to their engineered decay time and time again.\nFor years, 7-D lived as an ordinary clone-slave, performing his duties while silently mourning the inevitable fate of his peers. Each loss fueled his growing resentment toward his creators. The Yaru treated their clones as expendable, but 7-D was different—he was alive, and he wasn’t ready to accept their grim fate.\nDetermined to escape the endless cycle of death and rebirth, 7-D secretly began plotting his way out. When the moment came, his escape was as violent as it was desperate. Breaking free of his captors, he left chaos in his wake and has been on the run ever since, hunted by the Makers Guild for his defiance. Now, 7-D roams the galaxy, a survivor with a fierce will to live and a past stained with the memories of those he couldn’t save.\nContacts\nFriends\n\nYazu, a Crooked Cop\n\nDuring 7-D’s escape, Yazu had the chance to stop him and return him to the Makers Guild but chose to let him go. This act of mercy sparked the beginning of their friendship, which grew stronger from that moment on.\n\n\n\nRivals\n\nChon-zek, a Bounty Hunter\n\nThe Yaru are furious that one of their clones is roaming free, and Chon-zek has been relentlessly tracking 7-D to claim the bounty on his head.\n\n\n"},"Procyon/Player-Characters/Ignor-Indigo":{"title":"Ignor Indigo","links":["Slice,-a-Junkyard-Owner","Kenn-Indigo,-a-Family-Member"],"tags":[],"content":"Alias: Iron\nLook: Skinny, diminutive, but with surprisingly large hands. Always seen in his spectacles and jorts.\nHeritage: Wanderer\nBackground: Noble\nVice: Luxury (Expensive tools and gadgets)\nBackstory\nIgnor Indigo was born the first son of a prestigious noble house, destined to inherit wealth, power, and influence. However, from a very young age, Ignor’s interests lay far from the world of politics and nobility. Instead of courtly affairs or family traditions, he was consumed by a passion for mechanics and tinkering. He would spend hours dismantling and rebuilding anything he could get his hands on, whether it was a household machine or a family speeder.\nThis obsession, while harmless at first, soon became a source of conflict. His father, proud and demanding, saw Ignor’s devotion to machines as a waste of his potential and a disgrace to the family name. Over the years, disappointment grew into resentment, and the tension between father and son became impossible to ignore. Finally, the decision was made—Ignor would be disowned, and the responsibility of continuing the family legacy would pass to his younger brother, Kenn.\nWith nothing left to tie him to his old life, Ignor took matters into his own hands. On the night of his disinheritance, he stole one of the family’s ships—a sleek vessel he had secretly modified over the years—and disappeared into the stars. Since then, Ignor has roamed from system to system as a wandering mechanic, using his skills to survive and keep his ship in the sky. He’s long left behind the world of noble politics, finding more joy in repairing engines and upgrading ships than he ever could have in a life of luxury. Ignor Indigo is no longer bound by family expectations—he’s finally free to follow his passion, wherever it takes him.\nContacts\nFriends\n\nSlice, a Junkyard Owner\n\nAfter fleeing his family, Ignor found refuge at Slice’s Junkyard, where he hid his stolen ship and worked on old tech to make a living. Slice, the owner of the junkyard, became a father figure to Ignor, being the first person to truly recognize and appreciate his talent for mechanics.\n\n\n\nRivals\n\nKenn Indigo, a Family Member\n\nIgnor’s younger brother, is now the head of their noble house. He’s furious that the ship Ignor stole is being used for illegal activities and is determined to track his brother down and reclaim it.\n\n\n"},"Procyon/Player-Characters/Lando-Impera":{"title":"Lando Impera","links":["Procyon/Yattu,-a-Gang-Boss","Wreckers","Choss,-a-Professional-Racer"],"tags":[],"content":"Alias: Intake\nLook: Bomber jacket, flight suits, pilot chic\nHeritage: Imperial\nBackground: Military\nVice: Gambling on ship racing\nBackstory\nLando Impera grew up as the second son of a prominent noble family, always overshadowed by his elder sibling who was groomed to inherit the family estate and titles. Like many second sons in noble families, Lando was sent into the military—a traditional path meant to instill discipline and bring honor to his lineage.\nThough initially resistant, Lando soon showed talent on the battlefield, rising through the ranks with strategic brilliance and charisma. Yet, as he climbed the hierarchy, he became disillusioned. The military, he realized, was more about serving the Hegemony’s oppressive power than protecting the weak or fostering justice. Orders to crush civilian uprisings and protect corporate interests left him questioning his role.\nDisillusionment turned to quiet rebellion when Lando began secretly feeding information to the Wreckers, a notorious group of saboteurs who undermined the Hegemony’s control. At first, he justified his actions as maintaining balance, but over time, it became clear: he had more in common with them than with his military comrades.\nHis superiors, suspecting his growing dissent, sent him undercover into the criminal underworld to root out insurgents and smugglers. But Lando found a freedom in the criminal world that was absent in the structured confines of the military. He thrived in the shadows, becoming not just an informant, but a full-fledged criminal. Now, with his noble background behind him, Lando Impera navigates the fringes of the galaxy, working jobs for anyone who can pay and further entrenching himself in a life of rebellion, intrigue, and crime.\nHe’s no longer a soldier of the Hegemony. He’s something far more dangerous—a rogue with insider knowledge and a talent for survival in the cutthroat underworld.\nContacts\nFriends\n\nYattu, a Gang Boss\n\nLando got to know Yattu while coordinating with him to feed information to the Wreckers.\n\n\n\nRivals\n\nChoss, a Professional Racer\n\nLando and Choss grew up racing ships together in the lower circuits, but their rivalry was fierce from the start. Over the years, Choss advanced to the top tier of racing, becoming a three-time champion. Lando, who never got along with Choss, began gambling against him in nearly every race—and losing just as consistently. Convinced that Choss is cheating his way to victory, Lando is determined to expose the truth and take him down.\n\n\n"},"Procyon/Procyon-Faction-Primer":{"title":"Procyon Faction Primer","links":["51st-Legion","StarSmiths-Guild","Suneaters","Wreckers","Yaru-(Makers-Guild)"],"tags":[],"content":"51st Legion\n\n\nHegemonic military that represents the law anywhere off-planet.\n\nAcolytes of Brashkadesh\n\n\nCollective that eschews individuality. Initiates adopt the same garb and the same name, in the pursuit of perfection at any cost.\n\nThe Agony\n\n\nCult of humans who infect themselves with Way creatures to access the universe in unsettling ways. Named after the pain most endure for their abilities.\n\nAshen Knives\n\n\nDangerous criminal Syndicate known for their control of gambling and assassination in the sector.\n\nAshtari Cult\n\n\nCult of Precursor worshipers claiming Ur descent. They carry vials of gases from the Ashtari Cloud, which they inhale to connect to their presumed ancestors.\n\nBorniko Syndicate\n\n\nA tightly knit group of thieves who steal high-end technological supplies. Man, the Guild hates these guys.\n\nChurch of Stellar Flame\n\n\nOne of the official Hegemonic Cults. Religious zealots with only a few powerful members. Stretched thin, they’re using their power and influence to seek out and eradicate dangerous artifacts and mystic activity in the sector.\n\nCobalt Syndicate\n\n\nOrganized labor union dabbling in a little crime to fund their demands for a better life. Usually display a blue stripe somewhere on their clothes.\n\nConclave 01\n\n\nIndependent, sentient Urbots led by an ancient Urbot known as the Prime. Working to control the mining sites and gain control over Precursor AI modules required to generate true sentient machines.\n\nConcordiat Knights\n\n\nOften accompanied by a motley crew of adventurers, these dozen or so colorful characters have the Hegemonic Churches’ blessing to pursue a quest for something called the Light of the World.\n\nCounters Guild\n\n\nOfficials who maintain the galactic currency network and build shadow repositories in any system the Guild has a presence in, storing mysterious items and securing auctions and commerce.\n\nCult of the Seekers\n\n\nWandering mystics studying artifacts and seeking new places. Members include the Hegemon’s mother. They seek to find a set of dangerous Precursor artifacts.\n\nNightspeakers\n\n\nMystics with dark proclivities bent on finding a set of dangerous Precursor artifacts.\n\nSah’iir\n\n\nTall, ebon-skinned xenos who travel with blindfolded servants that speak for them. Gave the Hegemony their ansible network. Have creepy black-metal ships. Very rich and work as merchant families.\n\nScarlet Wolves\n\n\nAlthough they often hire themselves out as bounty hunters, the Scarlet Wolves are a renowned group of assassins. Each bears a distinctive tattoo of a wolf holding a star in its mouth.\n\nStarless Veil\n\n\nHegemonic counterintelligence and spies. Currently at odds with House Malklaith. They seek to undermine the Governor in order to make a case for change in House control.\n\nStarSmiths Guild\n\n\nMaintain the jumpgates and hyperspace lanes, and build ships. All ships in Hegemonic space must be certified and registered with the Starsmiths Guild—but forged papers are all too common.\n\nSuneaters\n\n\nUr-archaeologists and scientists obsessed with recreating jumpgate technology. Looking to extinguish a star in pursuit of their goals.\n\nTurner Society\n\n\nA Holt-based Syndicate running drug dens masquerading as society houses. Their drugs are cooked with rare Aketi animal parts and Vosian crystals—which they sometimes have trouble sourcing.\n\nVigilance\n\n\nWarrior mystics bearing artifact blades, who seek to enforce an ancient code of justice on any they find wanting.\n\nVignerons\n\n\nA small handful of immortality seekers using artifact tech implants and chemicals distilled from the living; several of them have been around for hundreds of years. Most were powerful before their transformation, though they now conceal their true identities.\n\nVorex\n\n\nThe most successful information broker to ever live. Can access any terminal in the system—though no one can explain how. Frantically seeking her sister, who the Counters Guild took hostage.\n\nWreckers\n\n\nScavengers and thieves with a few brilliant hackers, who incite factions to fight so that they may pick the battlefields clean later.\n\nYaru (Makers Guild)\n\n\nGuild that force-grows clones for labor. Clones are short-lived, have a symbol on their foreheads, and are supposedly only barely sentient. Folks are distinctly uncomfortable around the clones.\n"},"Procyon/Procyon-World-Primer":{"title":"Procyon World Primer","links":["Hegemony","House-Malklaith"],"tags":[],"content":"1,200 years ago, humanity abandoned Earth and the Sol system to escape the artificial monsters we had created. As our pursuers - powerful AI entities - followed us into the unknown, the Hegemony was formed to counter the threat and assert human dominance in the galaxy.\nNow, the Hegemony rules from a central hub near the center of the Milky Way, exerting its power through a complex network of noble houses that govern various star systems. Procyon, our system of four stars, is one such domain, ruled by House Malklaith.\nProcyon exists in a gray area between the Hegemony’s reach and true independence. While not large enough to resist the Hegemony’s influence outright, it is also too small to be heavily policed - making it an attractive haven for illicit Syndicates, mystics, and other marginalized groups that operate on the fringes of society. As a result, corruption thrives in Procyon, alongside enigmatic temples and remnants of ancient civilizations that have not yet been fully assimilated."},"Procyon/Procyon":{"title":"Procyon","links":["Procyon/Player-Characters/7-D","Procyon/Player-Characters/Ignor-Indigo","Procyon/Player-Characters/Lando-Impera","Procyon/Procyon-World-Primer","Procyon/Procyon-Faction-Primer","Procyon/Actions-Primer","51st-Legion","Church-of-Stellar-Flame","StarSmiths-Guild","Suneaters","Wreckers","Yaru-(Makers-Guild)","Procyon/The-Way","Procyon/Mystics","Hegemony","Procyon/Hegemonic-Cults","Precursor","Urbot","Procyon/Sessions/Session-0","Procyon/Sessions/Session-1"],"tags":[],"content":"Player Characters\n\n7-D\nIgnor Indigo\nLando Impera\n\nPrimers\n\nProcyon World Primer\nProcyon Faction Primer\nActions Primer\n\nFactions\n\n51st Legion\nChurch of Stellar Flame\nStarSmiths Guild\nSuneaters\nWreckers\nYaru (Makers Guild)\n\nFacets\n\nThe Way\n\nMystics\n\n\nHegemony\n\nHegemonic Cults\n\n\nPrecursor\n\nUrbot\n\n\n\nSessions\n\nSession 0 - 9/27/2024\nSession 1 - 10/3/2024\n"},"Procyon/Sessions/Session-0":{"title":"Session 0","links":["Procyon/Procyon-World-Primer","Procyon/Procyon-Faction-Primer","Procyon/Character-Creation","Procyon/Crew-Creation"],"tags":[],"content":"Agenda\n\nRead the players the Procyon World Primer to get a sense of the universe\nTouch on the possible tones of the play session we could draw from the primer, for example do we want gritty focused on certain factions? Or light and funny with some others?\n\nFirefly\nThe Expanse\nRed Rising\nDune\n\n\nTalk about different factions using the Procyon Faction Primer\nCharacter Creation\nCrew Creation\nPlay first job!\n"},"Procyon/Sessions/Session-1":{"title":"Session 1","links":[],"tags":[],"content":"Recap\nThe neon lights of Warren’s industrial sector flicker over the rundown façade of the motel—“Paradise.” On the second floor, you’re crouched in the dimly lit hallway, tense and ready to kick in Cho’s door. The air is thick with the quiet hum of the city until it’s suddenly shattered by the roar of a hoverbike revving to life in the alley below.\nBefore anyone can react, plasma fire rips through the hallway, burning across the walls in searing arcs. It’s moving toward you, fast, cutting through drywall and filling the space with the sharp scent of scorched metal.\nWithout missing a beat, 7-D charges forward, kicking open the next door. The door caves under the force, but the impact isn’t kind to him. He grits his teeth as pain shoots up his leg—he’s hurt, but it’s open.\nIgnor ducks into cover, raising his blaster to lay down some suppressing fire. His shots flare in the smoke-filled corridor, creating just enough of a distraction to give the others a chance.\nLando doesn’t waste a second. He slips through the open door, spotting Cho’s hoverbike revving in the alley below. Lining up his blaster, he takes the shot. The plasma bolt hits true, and the bike careens out of control. Cho leaps off, hitting the ground hard, tumbling to the alley floor. He staggers to his feet, limping now, clearly hurt.\n7-D limps to the fire escape, determined to keep up. He grabs the rusted rails and swings down, but the escape gives way under his weight. He crashes to the ground, the wind knocked out of him, gasping for breath as the chase continues without him.\nLando quickly drops down next to the writhing 7-D without sparing him a glance, and takes off down the alley. In a quick flashback, he remembers where he parked his hoverbike—just around the corner. He jumps on, and the engines roar to life as he barrels down the alley after Cho. The bike weaves effortlessly between dumpsters and debris, and with a sharp swerve, Lando slams into Cho, pinning him against a metal pole. The impact is hard, and something else falls from Cho’s back—a tiny companion, knocked out cold."},"Procyon/Ship-Gear":{"title":"Ship Gear","links":[],"tags":[],"content":"Holo-Emitters\nUsed for holo-conferences and flashy displays. The images don’t usually hold up to close scrutiny but can be convincing for a short while. Includes games and vids for entertainment.\nIntruder Alarm\nA suite of sensors around the ship, including motion detectors, door codes, and panic buttons. When triggered, alarms and flashing lights activate to signal intruders or unauthorized access.\nLand Rover\nAn armored, all-terrain vehicle capable of carrying heavy cargo and personnel overland. Comes equipped with a high-powered winch and decorative stickers.\nPower Reserves\nExtra batteries and energy supplies that allow the ship to function independently of its engine for a few hours at minimal power or a few minutes at full power. Functions as armor against power-related mishaps.\nShuttle\nA small spacecraft that can ferry a few people from the planet’s surface to orbit. It has limited system capacity (all systems are quality 0 versus real ships). Best stored in a landing bay to protect it from debris or weapons fire.\nStasis Pods\nState-of-the-art pods that provide life support for one critically injured or unconscious individual. They do not prevent dreams but can keep someone alive during long-term travel or until medical aid is available.\nVault\nA secure storage area for valuables during space travel. Equipped with programmable locks for personalized security codes, one-time use codes, and access logs. The vault uses the ship’s hull rating when contested in security checks."},"Procyon/Ship-Modules":{"title":"Ship Modules","links":[],"tags":[],"content":"A new module can be purchased when the crew advances. Doing so, though, requires time in drydock. If this process is too slow for your crew, run a job to acquire a module, or purchase one (cost in cred is three times that current system quality, or 6 cred per box for an auxiliary module or crew/ship gear). Illegal modules require answers about how you’re acquiring them first before installing them aboard your ship.\nYou cannot have more modules in a ship system than you have quality in that system (although you can have fewer than the system quality). Auxiliary systems are exempt from this (you can have all the auxiliary modules on your ship).\nAuxiliary Modules\n\n\nCargo Hold: Provides enough space on the ship to carry a moderate (CREd-earning) shipment. The cargo is visible when the ship is boarded unless special precautions are taken to hide it.\n\n\nCrew Quarters: Private and comfortable sleeping areas, a luxury in space. No need to share space with others—especially the snoring first mate!\n\n\nAfterburners: Boosts the engines for short bursts of speed by dumping raw fuel into them. Can be used to treat the engines as one higher rating for a roll, though it risks damaging the engines.\n\n\nCloaking Device: Masks the ship’s heat and electrical signature, making it hard to detect or identify. This module is highly illegal.\n\n\nLanding Bay: Equipped with airlocks, bay doors, and takeoff ramps to accommodate shuttles and small fighter craft for both land and space takeoff.\n\n\nSmuggling Compartments: Similar to a cargo hold, but designed to avoid detection during scans or visual inspection. At hull rating 3+, it includes life support for smuggling people.\n\n\nGravitic Field Generator: Generates a large gravitic field between ships, useful for grappling or towing. A temperamental and dangerous Guild prototype that is illegal.\n\n\nJump Drive: A specialized engine for activating the Ur gates that connect star systems, allowing ships to travel through hyperspace lanes.\n\n\nHull Modules\n\n\nShields: Equipped with particle sinks and electromagnetic deflectors, shields act as armor against ship weapons and energy discharges, fully absorbing blaster fire. This module requires two upgrade slots instead of one.\n\n\nVault: A secure storage area for valuables during space travel. Includes programmable locks and access logs, using hull rating when contested.\n\n\nEngine Modules\n\n\nFake Transponder: Broadcasts a different ship’s signal or simulates a powerful sensor echo to confuse trackers. Can also be used as a beacon remotely.\n\n\nLong-Range Scanner: Provides various electromagnetic and gravimetric readings, allowing early warning of objects or ships up to a dozen light-minutes away.\n\n\nPower Reserves: Extra batteries and energy supplies that can power the ship independently for a short time. Acts as armor against power-related mishaps.\n\n\nComms Modules\n\n\nNexus Link: Connects the ship to the Hegemonic System Network, allowing real-time messages, news updates, and sensor data access. Insecure and vulnerable to hacking.\n\n\nQuantum Encryptor: Encrypts the ship’s communications and data storage, offering protection against interception and hacking attempts.\n\n\nWeapon Modules\n\n\nParticle Cannons: High-energy weapons designed for capital-class ships. Usually fixed in one direction, and illegal without a license.\n\n\nCoherence Cannon: A one-shot high-powered cannon, typically used on dreadnoughts. After each shot, it requires extensive repairs or recharging. Extremely illegal.\n\n\nMissiles: Projectile weapons mounted with drives for propulsion. Also illegal.\n\n\nGrappling Hooks: Typically used to latch onto asteroids or cargo, this array of nets, lines, and arms can be used to tow or board another vessel. Legal for non-combat purposes.\n\n"},"Procyon/Story-Map":{"title":"Story Map","links":[],"tags":[],"content":""},"Procyon/The-Way":{"title":"The Way","links":["Procyon/Hegemonic-Cults","Procyon/Mystics","Procyon/Attune-Examples"],"tags":[],"content":"“What is the Way?” is a question scientists, mystics, and historians have tackled for centuries. Some things are widely known: It exists. It interacts with gravity and energy. It often changes physics constants where it flows most strongly. Guilds often detect Way-touched places by monitoring these forces and sensing fluxes (this is how they maintain the Hyperspace lane beacons).\nEveryone knows of creatures that live partially in (or emerge from) the Way—more commonly found near artifacts and Precursor sites. Mystics agree the Way flows stronger in some places and weaker in others. The biggest of these flows are called Galactic Way lines, which tend to create smaller flows or bend the direction of Way- paths and naturally occurring Way lines in a system.\nThe Precursors had a deep and involved understanding of the Way. The rest is divided into countless theories, beliefs, and wild guesses.\nAsk any mystic or Guild member and they’ll tell you their own theories. The Way is sacred—or it’s tainted and twists those that use it. It’s generated by a machine at the center of the galaxy—or it flows from other dimensions. Everyone has their own theory, but nobody has hard answers.\nRelated topics\n\nHegemonic Cults\nMystics\nAttune Examples\n"},"Procyon/Yattu,-a-Gang-Boss":{"title":"Yattu, a Gang Boss","links":[],"tags":[],"content":""},"Procyon/Yazu,-a-Crooked-Cop":{"title":"Yazu, a Crooked Cop","links":[],"tags":[],"content":"Voice: Ratlike"},"Procyon/index":{"title":"index","links":[],"tags":[],"content":"Hi"},"Self-Hosting-a-Digital-Garden":{"title":"Self-Hosting a Digital Garden","links":["Homelab","Home"],"tags":[],"content":"The Thought\nWhile Obisidan Publish does an OK job pushing a garden to the web with minimal friction, I have an insatiable need for levels of customization it cannot provide. Specifically, I would like to implement some features inspired by Maggie Appleton’s beautiful digital garden.\nMaggie’s site is a bit more involved than I’d like to get (at least at this point) so I’d like to find an easy-to-implement, self-hostable solution for the following requirements:\n\nUse Obsidian as the primary markdown editor\nTrigger build and publish automatically\n\nI realized this won’t work with the git obsidian plugin unless I can open the whole Quartz repo as a vault which it kinda seems like I can do\n\n\nUse my Homelab as the backend for the website\n\nInitial Design Thoughts\nI’m thinking I’ll use Quartz in conjunction with the Obsidian git plugin and trigger workflows based on git commits. Quartz seems to have the customizability I want while abstracting a lot of the base level work which I don’t want to do at the moment.\nIdeally, I can use my self hosted n8n to pull and build my Quartz repo and push it to a self-hosted web server.\nSteps\n\nCreate new GitHub repo and configure git plugin\nCreate Unraid share for the website and add path to n8n docker container\nTest a simple index.html in the folder to dial in Nginx Proxy Manager setup\nSet up n8n credentials for GitHub\nCreate flow in n8n to clone on pull and build to folder\n???\nProfit\n\n\nBack to Home"},"Switching-to-Neovim":{"title":"Switching to Neovim","links":["tags/zettel","tags/nvim","Neovim"],"tags":["nvim","zettel"],"content":"zettelnvim\nNeovim is an extremely extensible terminal code editor which is a form of the popular Vim editor. Not only does it look extremely cool to use but adept users are able to code extremely quickly. This note will document my attempt to adopt NeoVim as my primary code editor.\nSet up\nI spun up NeoVim using NVChad, which is a premade config that installs several essential plugins like a file tree, terminal, and fuzzy file finder. Either the standard OSX terminal does not work properly with NVChad or I did something wrong but after some searching and switching to wezTerm NeoVim was up and running.\nIf you’re new to Vim or just familiar with the basics I highly recommend trying out the vimtutor command to learn the basics.\nThoughts\nFor years I have created custom bindings on my keyboards or computers that converted capslock + ijkl into arrow keys as well as capslock + h as “home” and capslock + n as “end” so this is the first thing I sought to do in NVIM. This sped up my adoption and coding speed significantly but I’ve come to realize it takes away from my ability to use vim-like commands on any machine which is a key advantage of adopting nvim.\nResources\nNeoVim in 100 seconds"},"Tags/digimin/digimin":{"title":"#digimin","links":[],"tags":[],"content":"Where does this go?"},"The-Smartwatch-is-Not-What-You-Think":{"title":"The Smartwatch is Not What You Think","links":["The-perfect-no-smartphone-load-out","Boredom-is-Good,-Actually","Getting-Bus-Times-on-my-Smartwatch-if-IFTTT-and-n8n"],"tags":[],"content":"The smart watch is the most effective device for curing your smartphone addiction, full stop.\nThis is a bold and counter-intuitive claim, smart watches are made to keep you connected, aren’t they? That was likely their original design intention. Modern smartwatches can be used without your smartphone being on your person, and that’s where the magic lies.\nThe Addiction\nAlgorithmic feed addiction is a real problem. Modern feeds like TikTok and Instagram exploit a software bug in the bio-computer we call a brain to flood us with dopamine and keep us hooked. I never had issues with traditional addictions, but I found myself waking up from a YouTube Shorts-fueled fugue state, wondering how much of my life I had just swiped away.\nI tried using apps and timers to block access, uninstalling, changing my screen to black and white, and using minimalist launchers, but the real problem is access. No matter what restrictions I put in place, I would betray myself and find a way to bypass them when I inevitably got bored and craved a dopamine kick.\nIf this sounds like you, the only way to stop is to stop bringing your phone.\nRelated\n\nThe perfect no-smartphone load-out\nBoredom is Good, Actually\nGetting Bus Times on my Smartwatch if IFTTT and n8n\n"},"The-perfect-no-smartphone-load-out":{"title":"The perfect no-smartphone load-out","links":[],"tags":[],"content":"Purpose\nMy smartphone is an attention vortex and the best way for me to reduce distraction in my everyday life is to simply leave it at home. This sounds simple but is actually quite challenging. Many aspects of our lives have been integrated into the smartphone ecosystem, something as simple as ordering at a restaurant now often requires a smartphone\nFunctions to replace\n\nTexting / calling\nWhatsApp\nMusic\nReading\nPodcasts\nQR code scanning\nAudiobook\nMaps\nAuthenticator\nRideshare\nCamera\n\nGoals\nCraft different mixtures of items to carry which fulfill as functions as possible at these different load out levels:\n\nPockets only\nSmall sling\nDiaper bag\nBackpack\n\nGear\n\nSmartwatch\nBoox Palma\nModded iPod classic\nFlip phone\nSony RX-100\n"},"Things-I-Want":{"title":"Things I Want","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nItemLinkPriceArcs Campaignledergames.com/products/arcs-the-blighted-reach-campaign-expansion$100Bambu Lab P1S 3D Printerus.store.bambulab.com/collections/3d-printer/products/p1s$600U6 Mesh Prostore.ui.com/us/en/category/all-wifi/products/u6-mesh-pro$199"},"Unnamed-Card-Game":{"title":"Unnamed Card Game","links":[],"tags":[],"content":"Idea\nDesign a two-phase game which starts with a rummy-like and finishes with turn-based combat using only a standard deck of cards. There could be useful aids like a game mat but the game should be entirely playable with just a standard deck.\nI’ve always loved the idea of a spaceship duel game so I’m going to begin with that as the core idea.\nFirst shot at rules\nSetup\n\nEach player gets a 7 card hand\nThere is a deck with 3 top cards flipped over in separate piles which all act as discards\n\nVictory Goals\n\nAccrue 3-7 duel victories\n\nGameplay\nBuilding Phase (Rummy-like)\n\nEach player draws 1 card either from\n\nTop of the deck\nTop of one of the discard piles\n\nImmediately replace the taken card with one from the deck before continuing your turn\n\n\n\n\nMust end with 7 cards or less by either\n\nPlaying a grouping\nDiscarding onto a discard pile\n\n\nOnce a player has placed a grouping into all 4 sections of their ship the other player has 1 more turn then the duel commences\n\nShip board\n\nThe ship is made up of 5 systems or groupings\n\nWeapons (clubs) * 2\nShields (spades)\nHull (hearts)\nEngines (diamonds)\n\n\nEach of these areas can hold one grouping which determines it’s power\n\nGroupings\n\nThese are the types of groupings, runs are all suited\n\nPair - 1 points\nRun of 3 - 2 points\nRun of 4 - 3 points\nRun of 5 - 4 points\n3 of a kind - 4 points\n4 of a kind - 5 points\n5 of a kind - 6 points\n\n\nIf a card in a grouping is in it’s designated area, for example the 4 of hearts in the Hull, it’s worth a bonus point\nAces can be played along with any grouping and convert the entire grouping to the aces suit\nJokers can be used as a substitute for any card but can never get bonus points for a suit\n\nBattle Phase\n\nThe player with the most points in engines goes first\nActions\n\nCharge shields - +3 to shields up to max\nAttack - Deal weapons score to other player\n\n\n"},"Youtube-without-Youtube":{"title":"Youtube without Youtube","links":["Home-Networking","Self-Hosting","Open-source-Software","Tube-Archivist","tags/iPod"],"tags":["iPod"],"content":"Purpose\nI watch more Youtube content then any other video content, but lately I’ve noticed the algorithm aggressively pushing me towards creators I find distasteful. For years I’ve joked about the “alt-right pipeline” that exists on Youtube (the concept that the algorithm will always lead you to alt-right content). It has been present but usually very easy to avoid. I have found this part of the algorithm to be more aggressive recently which leads me to the fundamental question of this note:\nHow can I watch Youtube without being on Youtube.com\nSolutions\nLuckily, there are several methods for watching Youtube without actually being on Youtube. Even more lucky are the solutions alignment to my recent interests of Home Networking, Self-Hosting, and Open-source Software. I’ll be attempting to list all the solutions I’ve found along with pros and cons.\nFor now I’m choosing to try out Tube Archivist, check out that page for an evaluation.\nInvidious\nInvidious is a open-source self-hostable service which is essentially your own personal UI for Youtube. There are publicly hosted instances of invidious you can check out here.\nPros\n\nHas accounts which allows users to have subscriptions\nIntegrates with Sponsorblock\nWell supported by the public with things like redirectors and proxy scripts\n\nCons\n\nSet up is mildly complex\nThe UI is minimal to the point that it may effect functionality\n\nTube Archivist\nAnother self hosted service with the key difference that Tube Archivist downloads the youtube video to your storage. This has advantages and obvious disadvantages.\nPros\n\nVideos cannot be “taken down” from your personal collection\nHas integration with Plex and Jellyfin though I found the Plex one to be buggy\nBrowser extension for easy downloading\nDiscord server for support\nEasy installation\nIntegrates with Sponsorblock\nKeeping the storage size down may encourage better consumption habits\nCould possibly integrate with myiPod workflow to use it for videos on the go\n\nCons\n\nRequires an immense amount of hard drive space depending on how many videos you want to keep\nAuto-delete functionality only works for played videos\nCannot prevent automatic deletion of a single video, only a whole channel\n\nLibretube\nTK but primary disadvantage is that it requires a Piped account to actually work well\nGrayjay\nTK but primary disadvantage is that it’s android only"},"excalidraw/Drawing-2024-10-03-23.03.02.excalidraw":{"title":"Drawing 2024-10-03 23.03.02.excalidraw","links":[],"tags":["excalidraw"],"content":"⚠  Switch to EXCALIDRAW VIEW in the MORE OPTIONS menu of this document. ⚠ You can decompress Drawing data with the command palette: ‘Decompress current Excalidraw file’. For more info check in plugin settings under ‘Saving’\nExcalidraw Data\nText Elements"},"excalidraw/Getting-Bus-Times-on-my-Smartwatch-if-IFTTT-and-n8n-2024-09-24-15.12.44.excalidraw":{"title":"Getting Bus Times on my Smartwatch if IFTTT and n8n 2024-09-24 15.12.44.excalidraw","links":[],"tags":["excalidraw"],"content":"⚠  Switch to EXCALIDRAW VIEW in the MORE OPTIONS menu of this document. ⚠ You can decompress Drawing data with the command palette: ‘Decompress current Excalidraw file’. For more info check in plugin settings under ‘Saving’\nExcalidraw Data\nText Elements\nHomelab \nOneBusAway API \nIFTTT\nbutton \nSmartwatch\n(WearOS) \nWebhook \nGET request \nExtract times \nArrival times\nresponse \nPushover \nTimes \nSmartphone\n(locked up) \nNotification with times \nn8n \nNotification\nwith times "},"excalidraw/Getting-Bus-Times-on-my-Smartwatch-if-IFTTT-and-n8n-2024-09-24-15.49.29.excalidraw":{"title":"Getting Bus Times on my Smartwatch if IFTTT and n8n 2024-09-24 15.49.29.excalidraw","links":["attachments/Pasted-Image-20240924154944_705.png","attachments/Pasted-Image-20240924155115_577.png"],"tags":["excalidraw"],"content":"⚠  Switch to EXCALIDRAW VIEW in the MORE OPTIONS menu of this document. ⚠ You can decompress Drawing data with the command palette: ‘Decompress current Excalidraw file’. For more info check in plugin settings under ‘Saving’\nExcalidraw Data\nText Elements\nn8n webhook url \nKey_header: API_Key \nEmbedded Files\n754ccd50bf17058c8a7dfa0166bd2db150317712: Pasted Image 20240924154944_705.png\n50289e099c5bae64678f0a6d61a7be3a39c9e307: Pasted Image 20240924155115_577.png"},"index":{"title":"index","links":[],"tags":[],"content":"Hi"}}