[
  "tag-wrangler",
  "obsidian-admonition",
  "settings-search",
  "homepage",
  "url-into-selection",
  "obsidian-vimrc-support",
  "obsidian-excalidraw-plugin",
  "templater-obsidian",
  "table-editor-obsidian",
  "obsidian-git",
  "OA-file-hider"
]